==================
floating dict
==================

{{ {'k':'v', 'list': ['a', 'b']} }}

---

(source_file
  (expression
    (dict
      (pair
        (string
          (single_quote)
          (string_content_sq)
        )
        (string
          (single_quote)
          (string_content_sq)
        )
      )
      (pair
        (string
          (single_quote)
          (string_content_sq)
        )
        (list
          (string
            (single_quote)
            (string_content_sq)
          )
          (string
            (single_quote)
            (string_content_sq)
          )
        )
      )
    )
  )
  (text)
)

==================
dict as arg
==================

{{ config('x', {'k':'v'}) }}

---

(source_file
  (expression
    (fn_call
      (identifier)
      (argument_list
        (string
          (single_quote)
          (string_content_sq)
        )
        (dict
          (pair
            (string
              (single_quote)
              (string_content_sq)
            )
            (string
              (single_quote)
              (string_content_sq)
            )
          )
        )
      )
    )
  )
  (text)
)

==================
proper config call
==================

{{ config(x={'k':'v'}) }}

---

(source_file
  (expression
    (fn_call
      (identifier)
      (argument_list
        (kwarg
          (identifier)
          (dict
            (pair
              (string
                (single_quote)
                (string_content_sq)
              )
              (string
                (single_quote)
                (string_content_sq)
              )
            )
          )
        )
      )
    )
  )
  (text)
)

==================
dict spread over lines
==================

{{ {
  'k':'v',
  'x':[]
  } }}

---

(source_file
  (expression
    (dict
      (pair
        (string
          (single_quote)
          (string_content_sq)
        )
        (string
          (single_quote)
          (string_content_sq)
        )
      )
      (pair
        (string
          (single_quote)
          (string_content_sq)
        )
        (list)
      )
    )
  )
  (text)
)

==================
dict with bools
==================

{{ {'x':True, 'y': False} }}

---

(source_file
  (expression
    (dict
      (pair
        (string
          (single_quote)
          (string_content_sq)
        )
        (bool)
      )
      (pair
        (string
          (single_quote)
          (string_content_sq)
        )
        (bool)
      )
    )
  )
  (text)
)
