==================
Ref with string literal
==================

select * from {{ ref('my_table') }}

---

(source_file
  (text)
  (expression
    (function
      (identifier)
      (argument_list
        (string
          (single_quote)
          (string_content_sq)
        )
      )
    )
  )
  (text)
)

==================
Ref that uses identifier
==================

select * from {{ ref(not_a_string) }}

---

(source_file
  (text)
  (expression
    (function
      (identifier)
      (argument_list
        (identifier)
      )
    )
  )
  (text)
)

==================
Config with one kwarg
==================

{{ config(key='value') }}

---

(source_file
  (expression
    (function
      (identifier)
      (argument_list
        (kwarg
          (identifier)
          (string
            (single_quote)
            (string_content_sq)
          )
        )
      )
    )
  )
  (text)
)

==================
Config with two kwargs
==================

{{ config(key='value', key2='value2') }}

---

(source_file
  (expression
    (function
      (identifier)
      (argument_list
        (kwarg
          (identifier)
          (string
            (single_quote)
            (string_content_sq)
          )
        )
        (kwarg
          (identifier)
          (string
            (single_quote)
            (string_content_sq)
          )
        )
      )
    )
  )
  (text)
)

==================
Fn with a kwarg, string lit, list, and dict
==================

{{ config(
    key='value',
    'lit',
    {'key':'value'},
    ['a','b']
) }}

---

(source_file
  (expression
    (function
      (identifier)
      (argument_list
        (kwarg
          (identifier)
          (string
            (single_quote)
            (string_content_sq)
          )
        )
        (string
          (single_quote)
          (string_content_sq)
        )
        (dict
          (pair
            (string
              (single_quote)
              (string_content_sq)
            )
            (string
              (single_quote)
              (string_content_sq)
            )
          )
        )
        (list
          (string
            (single_quote)
            (string_content_sq)
          )
          (string
            (single_quote)
            (string_content_sq)
          )
        )
      )
    )
  )
  (text)
)

==================
parses other fn names
==================

{{ fn() }}

---

(source_file
  (expression
    (function
      (identifier)
      (argument_list)
    )
  )
  (text)
)

==================
buried fn names
==================

select
  field1,
  field2,
  field3
from {{ ref('x') }}
join {{ ref('y') }}

---

(source_file
  (text)
  (expression
    (function
      (identifier)
      (argument_list
        (string
          (single_quote)
          (string_content_sq)
        )
      )
    )
  )
  (text)
  (expression
    (function
      (identifier)
      (argument_list
        (string
          (single_quote)
          (string_content_sq)
        )
      )
    )
  )
  (text)
)

==================
bool args
==================

{{ fn(True) }}

---

(source_file
  (expression
    (function
      (identifier)
      (argument_list
        (true)
      )
    )
  )
  (text)
)

==================
bool kwargs
==================

{{ config(bind=False) }}

---

(source_file
  (expression
    (function
      (identifier)
      (argument_list
        (kwarg
          (identifier)
          (false)
        )
      )
    )
  )
  (text)
)

==================
True is an invalid fn name
==================

{{ True() }}

---

(source_file
  (expression
    (ERROR
      (true)
    )
    (tuple)
  )
  (text)
)
