==================
list of string lits
==================

{{ ['a','bc','def'] }}

---

(source_file
  (expression
    (list
      (string
        (single_quote)
        (string_content_sq)
      )
      (string
        (single_quote)
        (string_content_sq)
      )
      (string
        (single_quote)
        (string_content_sq)
      )
    )
  )
  (text)
)

==================
empty list
==================

{{ [] }}

---

(source_file
  (expression
    (list)
  )
  (text)
)

==================
list with trailing comma
==================

{{ ['a','bc','def',] }}

---

(source_file
  (expression
    (list
      (string
        (single_quote)
        (string_content_sq)
      )
      (string
        (single_quote)
        (string_content_sq)
      )
      (string
        (single_quote)
        (string_content_sq)
      )
    )
  )
  (text)
)

==================
config with list of string lits
==================

{{
  config(
    k='v',
    k2='v2',
    list=['a','bc','def']
  )
}}

---

(source_file
  (expression
  (fn_call
    (identifier)
      (argument_list
        (kwarg
          (identifier)
          (string
            (single_quote)
            (string_content_sq)
          )
        )
        (kwarg
          (identifier)
          (string
            (single_quote)
            (string_content_sq)
          )
        )
        (kwarg
          (identifier)
          (list
            (string
              (single_quote)
              (string_content_sq)
            )
            (string
              (single_quote)
              (string_content_sq)
            )
            (string
              (single_quote)
              (string_content_sq)
            )
          )
        )
      )
    )
  )
  (text)
)

==================
deeply nested lists and dicts
==================

"{{ [{'k':['v', {'x': 'y'}]}, ['a', 'b', 'c']] }}"

---

(source_file
  (text)
  (expression
    (list
      (dict
        (pair
          (string
            (single_quote)
            (string_content_sq)
          )
          (list
            (string
              (single_quote)
              (string_content_sq)
            )
            (dict
              (pair
                (string
                  (single_quote)
                  (string_content_sq)
                )
                (string
                  (single_quote)
                  (string_content_sq)
                )
              )
            )
          )
        )
      )
      (list
        (string
          (single_quote)
          (string_content_sq)
        )
        (string
          (single_quote)
          (string_content_sq)
        )
        (string
          (single_quote)
          (string_content_sq)
        )
      )
    )
  )
  (text)
)

==================
list with booleans
==================

{{ [True, False, 'string'] }}

---

(source_file
  (expression
    (list
      (bool)
      (bool)
      (string
        (single_quote)
        (string_content_sq)
      )
    )
  )
  (text)
)
