==================
list of string lits
==================

{{ ['a','bc','def'] }}

---

(source_file
  (expression
    (list
      (lit_string)
      (lit_string)
      (lit_string)
    )
  )
  (text)
)

==================
empty list
==================

{{ [] }}

---

(source_file
  (expression
    (list)
  )
  (text)
)

==================
list with trailing comma
==================

{{ ['a','bc','def',] }}

---

(source_file
  (expression
    (list
      (lit_string)
      (lit_string)
      (lit_string)
    )
  )
  (text)
)

==================
config with list of string lits
==================

{{
  config(
    k='v',
    k2='v2',
    list=['a','bc','def']
  )
}}

---

(source_file
  (expression
  (fn_call
    (identifier)
      (argument_list
        (kwarg
          (identifier)
          (lit_string)
        )
        (kwarg
          (identifier)
          (lit_string)
        )
        (kwarg
          (identifier)
          (list
            (lit_string)
            (lit_string)
            (lit_string)
          )
        )
      )
    )
  )
  (text)
)

==================
deeply nested lists and dicts
==================

"{{ [{'k':['v', {'x': 'y'}]}, ['a', 'b', 'c']] }}"

---

(source_file
  (text)
  (expression
    (list
      (dict
        (pair
          (lit_string)
          (list
            (lit_string)
            (dict
              (pair
                (lit_string)
                (lit_string)
              )
            )
          )
        )
      )
      (list
        (lit_string)
        (lit_string)
        (lit_string)
      )
    )
  )
  (text)
)

==================
list with booleans
==================

{{ [True, False, 'string'] }}

---

(source_file
  (expression
    (list
      (bool)
      (bool)
      (lit_string)
    )
  )
  (text)
)
