==================
bare words fail
==================

{{ text }}

---

(source_file
  (expression
    (identifier))
    (text))

==================
multiple jinja calls
==================

some text {{ 'floating lit' }} more text {{ config() }} text.

---

(source_file
  (text)
  (expression
    (string
      (single_quote)
      (string_content_sq)))
  (text)
  (expression
    (function
      (identifier)
      (argument_list)))
  (text))

==================
text with curlys works
==================

some curlys { }

---

(source_file
  (text))

==================
doesn't hang on the empty string
==================
---

(source_file)

==================
unclosed jinja calls fail
==================

{{ fn()

---

(source_file
  (expression
    (function
      (identifier)
      (argument_list))
    (MISSING "}}")))
